<?php
for ($i = 1; $i <= 100; $i++) {
    if ($i % 3 === 0 and $i % 5 === 0) {
        echo ('3の倍数であり、5の倍数' . "<br/>");
    } else if ($i % 3 === 0) {
        echo ('3の倍数' . "<br/>");
    } else if ($i % 5 === 0) {
        echo ('5の倍数' . "<br/>");
    } else {
        echo ($i . "<br/>");
    }
}
?>

<!-- 3の倍数であり、5の倍数だけ表示
<?php
for ($i = 1; $i <= 100; $i++) {
    if ($i % 3 === 0 and $i % 5 === 0) {
        echo ('3の倍数であり、5の倍数' . "<br/>");
    } else {
        echo ($i . "<br/>");
    }
}
?> -->

<!-- 1.2.3.3の倍数.4.5.6.3の倍数.7.8.9.3の倍数.10.11.12.3の倍数.13.14.3の倍数であり、5の倍数.16~~~と表示される
<?php
for ($i = 1; $i <= 100; $i++) {
    if ($i % 3 or $i % 5) {
        echo ($i . "<br/>");
        if ($i % 3) {
        } else {
            echo ('3の倍数' . "<br/>");
        }
    } else {
        echo ('3の倍数であり、5の倍数' . "<br/>");
    }
}
?> -->

<!-- 全て3の倍数であり、5の倍数で表示
<?php
for ($i = 1; $i <= 100; $i++) {
    if ($i % 3 and $i % 5) {
        echo ($i . "<br/>");
    } else {
        echo ('3の倍数であり、5の倍数' . "<br/>");
    }
}
?> -->

<!-- 3の倍数であり、5の倍数だけ表示
<?php
for ($i = 1; $i <= 100; $i++) {
    $three = $i % 3;
    $five = $i % 5;
    if ($three or $five) {
        echo ($i . "\n");
    } else {
        echo ('3の倍数であり、5の倍数' . "\n");
    }
}
?> -->

<!-- 3の倍数だけ表示
<?php
for ($i = 1; $i <= 100; $i++) {
    if ($i % 3) {
        echo ($i . "\n");
    } else {
        echo ('3の倍数' . "\n");
    }
}
?> -->
